[{"Title": "Senior Software Engineer", "Company": "The Maven Group, LLC", "Description": "Position Title. Senior Software EngineerPosition Type. Direct hirePosition Location. RemoteNote.. Minimum of 5 years experience designing and implementing web based software systems, with 7 to 10 years.."}, {"Title": "Product Software Engineer", "Company": "Wolters Kluwer", "Description": "Remain current with evolving industry trends and technologies in software development.Experience & CharacteristicsBachelors degree in Computer Science, Computer Engineering or equivalent.."}, {"Title": "Lead Embedded Software Engineer", "Company": "BAXTER", "Description": "The Lead Embedded Developer is an exciting role in supporting embedded software design activities within.. Primary focus of the role will be to provide engineering support for new product development.."}, {"Title": "Senior Software Engineer", "Company": "Parks, Experiences and Products", "Description": "These services include. systems level simulations of our rides and attraction. Software In the Loop.. Systems EngineerResponsibilitiesYou will be a designer, developer, and user of our suite of in house.."}, {"Title": "Sr. Software Engineer", "Company": "TFS", "Description": "SCOPEThe Senior Software Systems Engineer is responsible for leading full system software projects.. Software EngineeringDevelop code involving all fundamental aspects of an IoT system solution.Lead and.."}, {"Title": "Principal Software Engineer", "Company": "MetLife", "Description": "Position. Principal Software Engineer. Job Location. United States. North Carolina. Cary Alternate Job.. Partner across organizations within data and analytics, engineering, architecture and operations in.."}, {"Title": "Senior Software Engineer", "Company": "Sensus", "Description": "Sensus, a Xylem brand, seeks to hire a Sr Software Engineer, as a member of the Software Engineering.. they will architect, design, develop and test Java software applications. The successful candidate will.."}, {"Title": "Senior Software Engineer", "Company": "Ply Gem", "Description": "Cornerstone Building Brand is Seeking a Senior Software Engineer Full Stack Developer to work with our.. Summary. The Senior Software Engineer role uses an analytical, engineering focused approach and expert.."}, {"Title": "DevOps Software Engineer", "Company": "Lenovo", "Description": "Description and Requirements ResponsibilitiesBe responsible for key business application operation and development, including architecture design, system build, performance tuningB.."}, {"Title": "Embedded Systems Software Engineer", "Company": "Cerebral Staffing, LLC", "Description": "Job descriptionCerebral Staffing, LLC is seeking a. Embedded Systems Software Engineer to work for our.. As a Software Engineer for Turf & Compact Utility located in Cary, NC, you will be an integral part of a.."}, {"Title": "Senior Software QA Engineer", "Company": "Reperio Human Capital", "Description": "Desired SkillsNorth Carolina, Raleigh, Durham, Cary, QA, Developer, Engineer, Automation, Testing, Web.. We currently have an opening within our clients development team to join as a Senior Software QA.."}, {"Title": "Software Engineer – Instrument Data (Remote)", "Company": "Danaher", "Description": "Past work should be in software development, system integration or scientific instrument. Candidates.. Candidates with a background in electrical engineering will also be considered.Experience with compiled.."}, {"Title": "Embedded Software Engineer", "Company": "Kelly Services", "Description": "Embedded Software Engineer (applications using C and MATLAB Simulink). As a Embedded Software Engineer.. n this role, you will deliver embedded software on Turf and Compact utility tractors to provide.."}, {"Title": "Software Design Engineer - Product Engineering", "Company": "John Deere", "Description": "United States (US). Cary, North Carolina. Fargo, North DakotaFunction. Engineering (CA)Title. Software.. Software Design Engineer. Product EngineeringOnsite Remote Onsite Position This position is eligible for.."}, {"Title": "Software Engineer I", "Company": "Aquent", "Description": "Aquent will help with some relocation expenses if hired needing to relocate. As a Software Engineer for.. Strong passion for embedded engineering and learning new technologies. Experience with control systems.."}, {"Title": "Sr. Software Development Engineer in Test (SDET)", "Company": "Align Technology", "Description": "About this opportunity Align is seeking a Senior Software Development Engineers in Test (SDET) to assist.. Operate as a member of a cross functional development team. Ensuring Quality Engineering practices are.."}, {"Title": "Entry Level Software Engineer", "Company": "Revature", "Description": "Come join our community! As a Revature Entry Level Software Engineer you will receive on the job training to become an experienced software engineerRemote Interviews are starting now!Benefits.."}, {"Title": "Software Engineer I", "Company": "Vitamin T", "Description": "Aquent will help with some relocation expenses if hired needing to relocate. As a Software Engineer for.. Strong passion for embedded engineering and learning new technologies. Experience with control systems.."}, {"Title": "Sr Associate Software Engineer", "Company": "SAS Institute", "Description": "As a Sr. Associate Software Developer in the SAS Intelligent Decisioning R&D organization, you will join a team of talented engineers working collaboratively to ideate and deliver leading edge.."}, {"Title": "Software Architect - Senior Principal/Staff Software Engineer T04/T05", "Company": "Northrop Grumman", "Description": "Staff Software Engineer to support the Ground program in a software development lead capacity.. We have anticipated future growth to deliver additional ground capabilities.As the Software Architect.."}, {"Title": "Senior Software Development Engineer", "Company": "Apptio", "Description": "OverviewYou. You are an experienced software engineer who strives for excellence in the users.. ResponsibilitiesAs a senior software engineer at Apptio, you will Build scalable cloud native services.."}, {"Title": "Software Engineer", "Company": "DISNEY", "Description": "The Core Media team within Media Engineering defines and develops the video and audio transcoding and.. The Core Media team is looking for a software engineer to apply their technical knowledge and ability.."}, {"Title": "Software Security Test Project Engineer", "Company": "Rockwell Automation", "Description": "We are continuing to expand our portfolio of award winning software products and services. The Software.. The Software Security Test Engineer will be responsible for leading the analysis and implementation of.."}, {"Title": "Embedded Software Engineer", "Company": "Kelly", "Description": "Embedded Software Engineer (applications using C and MATLAB Simulink). As a Embedded Software Engineer.. n this role, you will deliver embedded software on Turf and Compact utility tractors to provide.."}, {"Title": "Embedded Software Engineer", "Company": "RFA Engineering", "Description": "RFA Engineering (www.rfamec.com) is looking for a growth oriented candidates that want to join our team.. and architects around the world to deliver software features.Utilize Scrum based project management.."}, {"Title": "Senior Software Engineer", "Company": "Wells Fargo", "Description": "About this role Wells Fargo is seeking a Senior Software Engineer responsible for the design.. years of software engineering experience2. years of Java experience2. years working with Spring and.."}]