[{"Title": "Lead Embedded Software Engineer", "Company": "BAXTER", "Description": "The Lead Embedded Developer is an exciting role in supporting embedded software design activities within.. Primary focus of the role will be to provide engineering support for new product development.."}, {"Title": "Senior Software Engineer", "Company": "Wells Fargo", "Description": "About this role Wells Fargo is seeking a Senior Software Engineer responsible for the design.. years of software engineering experience2. years of Java experience2. years working with Spring and.."}, {"Title": "Senior Software Engineer", "Company": "myGwork", "Description": "Software developers working on product development in an agile and collaborative environment, you.. requirements. Actively participate in research, discussions and decisions on software architecture.."}, {"Title": "Developer Relations Engineer, Reliable Software Delivery and Operations", "Company": "Google", "Description": "As a Cloud Developer Relations Engineer, you will build narratives and experiences that connect Google.. Coach teams on improving their reliable software delivery and operations performance.Create original.."}, {"Title": "SENIOR SOFTWARE ENGINEER", "Company": "HCL Technologies", "Description": "Job Description Posting To develop and deliver codes for the work assigned in accordance with time, quality and cost standards. (1.) To maintain existing features, troubleshoot bug.."}, {"Title": "Embedded Software Engineer", "Company": "Intuitive", "Description": "The successful candidate will contribute broadly to the Product Engineering team, with a focused.. Design and implement embedded software to support new software features, new hardware components to.."}, {"Title": "Lead Software Engineer - Remote", "Company": "C.H Robinson", "Description": "We have an exceptional opportunity for a Lead Software Engineer on our Accept Reject team who can help.. We are building brand new, data intensive software products that are focused on delivery sophisticated.."}, {"Title": "Software Engineer", "Company": "Baebies Inc.", "Description": "The successful candidate will become an instrumental part of a small team of software engineers who.. This position will initially focus on software testing, quality assurance and improvement of software.."}, {"Title": "Software Engineer (Security Clearance Required) - Remote Optional", "Company": "Hired", "Description": "Signup on Hired to find your dream job (remote work available) as a Security Software Engineer at one of 10,000. companies looking for jobseekers just like you.Companies on Hired apply to you.."}, {"Title": "Software Engineer (Java and C++)", "Company": "Alliance of Professionals & Consultants Inc", "Description": "Are you an experienced Software Engineer? If so, lets talk!Our client is actively seeking a talented.. Job Overview Are you an exceptional engineering leader with deep experience designing and building POS.."}, {"Title": "Senior Software Engineer, Rosetta Stone", "Company": "IXL", "Description": "IXL Learning, a leading edtech company with products used by 13 million students worldwide, is seeking Software Engineers who have a passion for technology and language learning to help us add.."}, {"Title": "Deloitte Risk & Financial Advisory - Associate Software Engineer (Summer/Fall 2023)", "Company": "Deloitte", "Description": "Position Summary Deloitte Risk & Financial Advisory Associate. Software Engineering (Digital Assets Blockchain)Do you thrive in times of disruption? Have a drive to be a part of the technology.."}, {"Title": "Mid-Level Software Engineer", "Company": "SONIFI Solutions Incorporated", "Description": "Creates, designs, develops, modifies, tests, and supports testing software, tools, and frameworks.. Youre Awesome At. 2. years of full stack Software Engineering. Delivering software products through.."}, {"Title": "Lead Software Engineer   Open Telemetry- Telecommute", "Company": "UnitedHealth Group", "Description": "Design, develop, test, deploy, maintain, and continuously improve software Share deep engineering.. years of work experience in modern software engineering 2. years of work experience specific to Cloud.."}, {"Title": "AI/ML - Sr Software Engineer, Siri", "Company": "Apple", "Description": "Key QualificationsMin 10 years of professional industry software engineering experience.Have shipped products to production, and supported extended them post launch.Has driven technical decision.."}, {"Title": "Sr. Embedded Software Engineer (m/f/d)", "Company": "SWARCO", "Description": "Were seeking a Sr. Embedded Software Engineer to be responsible for development and maintenance of.. The successful candidate must have knowledge of and experience with application software development on.."}, {"Title": "Software Engineer IV - Technical & Solution Architecture, Java,Spring, SpringBoot, AWS Cloud", "Company": "Truist", "Description": "Development includes but is not limited to customized coding, software integration, analysis.. This position serves as the technical expert on the team and is often the strongest engineer, answering.."}, {"Title": "Senior Software Engineer, Payment Authentication", "Company": "Square", "Description": "Job Description. As a software engineer on the Payments team, you will help build the Payments Platform.. You Will. Work with engineering, product, and other partners to build clean software. Develop modern.."}, {"Title": "Senior Full Stack  Software Engineer", "Company": "Freedom Debt Relief", "Description": "Job DescriptionThe Opportunity We are looking for a Senior Full Stack (Node.js React) Software Engineer.. Watch this video to get a glimpse into our Engineering culture!From your bed to your desk in 30 seconds.."}, {"Title": "Software Engineer", "Company": "NetApp", "Description": "And project management software (i.e., Jira, Trello, Asana, or similar) Knowledge of Servers, Disk.. EducationMust be pursuing or possess a degree in Computer Engineering, Computer Science, or an.."}, {"Title": "Senior Software Engineer (Multi-Threaded Java)- Remote", "Company": "New Relic, Inc.", "Description": "Description We are excited to consider a remote engineer! Remote team members will be expected to work.. years of confirmed experience in software developmentExperience in high throughput software developmentA.."}, {"Title": "Remote Software Engineer - (Python/Django)  - Up to $145k", "Company": "Michael Page", "Description": "Develop software and architecture for products that help political campaigns, nonprofits, and other progressive organizations. Prepare the platform to go from hundreds of users to hundreds of.."}, {"Title": "Software Engineer", "Company": "Experis", "Description": "Here at Experis, we are always looking to collaborate with talented people whod like to work with one of our enterprise clients.We are currently looking for a Software Engineer to join our team.."}, {"Title": "Principal Software Engineer - SailPoint IdentityIQ", "Company": "Fidelity Investments", "Description": "Job Description Principal Software EngineerIn this position you will join Fidelitys Enterprise.. We are seeking motivated Lead Software Engineer to work on the installation of, and migration to, an.."}, {"Title": ".Net Software Engineer", "Company": "IQVIA Holdings Inc.", "Description": "Contribute to project effort estimationsOur ideal candidate will have. Bachelors Degree Computer Engineering, Computer Science or related field. Experience in software development (2 5 years.."}, {"Title": "Senior Application Software Engineer (Business Intelligence)", "Company": "Seven Seven Softwares", "Description": "Act as a subject matter expert for Application Software developers and Engineers. Contribute to the entire implementation process including driving the definition of improvements based on.."}]