[{"Title": "Lead Embedded Software Engineer", "Company": "BAXTER", "Description": "The Lead Embedded Developer is an exciting role in supporting embedded software design activities within.. Primary focus of the role will be to provide engineering support for new product development.."}, {"Title": "Senior Ride Control Software Engineer", "Company": "Walt Disney Imagineering", "Description": "Perform Attraction based Software Engineering activities related to WDI ride control systems.. As an important contributor on an Agile based Software development team, work through the complete.."}, {"Title": "Senior Software Engineer", "Company": "Parks, Experiences and Products", "Description": "These services include. systems level simulations of our rides and attraction. Software In the Loop.. Systems EngineerResponsibilitiesYou will be a designer, developer, and user of our suite of in house.."}, {"Title": "Software Security Test Project Engineer", "Company": "Rockwell Automation", "Description": "We are continuing to expand our portfolio of award winning software products and services. The Software.. The Software Security Test Engineer will be responsible for leading the analysis and implementation of.."}, {"Title": "Software Engineer", "Company": "DISNEY", "Description": "The Core Media team within Media Engineering defines and develops the video and audio transcoding and.. The Core Media team is looking for a software engineer to apply their technical knowledge and ability.."}, {"Title": "Senior Software Engineer - Analytics -  DSaaS Platform", "Company": "Change Healthcare", "Description": "Senior Software Engineer. Analytics. DSaaS PlatformOur Data Solutions Team is seeking a world class.. In this role, you will enjoy working with a talented and diverse team of engineers specializing in deep.."}, {"Title": "Senior Software Engineer", "Company": "myGwork", "Description": "Software developers working on product development in an agile and collaborative environment, you.. requirements. Actively participate in research, discussions and decisions on software architecture.."}, {"Title": "Senior Princ Software Engineer", "Company": "Veritas Technologies", "Description": "We serve 99. of the Fortune 100, 90. of the Fortune 500, and are the market leader in Software defined.. Software Engineer will productively work in a highly collaborative agile team, coach junior team.."}, {"Title": "Developer Relations Engineer, Reliable Software Delivery and Operations", "Company": "Google", "Description": "As a Cloud Developer Relations Engineer, you will build narratives and experiences that connect Google.. Coach teams on improving their reliable software delivery and operations performance.Create original.."}, {"Title": "Software Engineer", "Company": "Baebies Inc.", "Description": "The successful candidate will become an instrumental part of a small team of software engineers who.. This position will initially focus on software testing, quality assurance and improvement of software.."}, {"Title": "Software Engineer - Remote Optional", "Company": "Hired", "Description": "Signup on Hired to find your dream job (remote work available) as a Software Engineer at one of 10,000.. By crafting a profile on Hired, were confident that youll find a job youll love!Software Engineers.."}, {"Title": "Lead Software Engineer   Open Telemetry- Telecommute", "Company": "UnitedHealth Group", "Description": "This Lead Software Engineer role will be accountable for delivery and execution of the platform.. The Lead Engineer will also act in a customer facing capacity, focusing on building automation to reduce.."}, {"Title": "Embedded Software Engineer", "Company": "Intuitive", "Description": "The successful candidate will contribute broadly to the Product Engineering team, with a focused.. Design and implement embedded software to support new software features, new hardware components to.."}, {"Title": "Software Engineer, Rosetta Stone", "Company": "IXL", "Description": "WHAT YOULL BE DOING Work with a team of talented engineers, both starting projects from scratch and.. years of experience in software engineeringBachelors or advanced degree in Computer Science or a.."}, {"Title": "Mid-Level Software Engineer", "Company": "SONIFI Solutions Incorporated", "Description": "Creates, designs, develops, modifies, tests, and supports testing software, tools, and frameworks.. Youre Awesome At. 2. years of full stack Software Engineering. Delivering software products through.."}, {"Title": "Senior UI Software Engineer - Infrastructure (Remote)", "Company": "New Relic, Inc.", "Description": "Description Please note that visa sponsorship is not available for this position.Our engineering.. were excited to talk to smart, motivated engineers, with a passion for building great software.."}, {"Title": "Senior Software Engineer, Devops", "Company": "Verily", "Description": "Talented and motivated engineers that are making a measurable difference in the world?SignalPath.. engaged development organization that is focused on delivering high quality software solutions.."}, {"Title": "Mts Software Engineer in test", "Company": "NetApp", "Description": "Job RequirementsStrong verbal and written communication skills. Experience with Ruby, Python, or similar programming languages Familiar with Test Planning and execution Experience .."}, {"Title": "Senior Software Engineer", "Company": "Noodle", "Description": "Description Senior Software EngineerOnline education is no longer a novel or niche idea. It is the.. This role works closely with Solutions Architects and other Software Engineers to onboard new university.."}, {"Title": "Sr. Embedded Software Engineer (m/f/d)", "Company": "SWARCO", "Description": "Were seeking a Sr. Embedded Software Engineer to be responsible for development and maintenance of.. The successful candidate must have knowledge of and experience with application software development on.."}, {"Title": "Staff Software Engineer", "Company": "GRAIL", "Description": "As a consequence, engineering teams are tasked with building software and hardware to automate and.. years of relevant work experience designing, developing, testing and maintaining software.You are.."}, {"Title": "Senior Staff Software Engineer - JAVA (Remote US)", "Company": "Mandiant", "Description": ". years experience building scalable software apps and services 5. years experience developing in JavaAbility to work in an iterative, agile development environment Extensive experience in.."}, {"Title": "AI/ML - Sr Software Engineer, Siri", "Company": "Apple", "Description": "Key QualificationsMin 10 years of professional industry software engineering experience.Have shipped products to production, and supported extended them post launch.Has driven technical decision.."}, {"Title": "Senior Full-Stack Software Engineer", "Company": "Fidelity Investments", "Description": "Job Description The TeamWe are seeking a Senior Full Stack Software Engineer with experience and a.. As a member of this team, you would be operating as a senior engineer on newly formed Agile team focused.."}, {"Title": "Lead Software Engineer - Remote", "Company": "C.H Robinson", "Description": "We have an exceptional opportunity for a Lead Software Engineer on our Accept Reject team who can help.. We are building brand new, data intensive software products that are focused on delivery sophisticated.."}, {"Title": "Software Engineer (Java and C++)", "Company": "Alliance of Professionals & Consultants Inc", "Description": "Are you an experienced Software Engineer? If so, lets talk!Our client is actively seeking a talented.. Job Overview Are you an exceptional engineering leader with deep experience designing and building POS.."}]